## Binning
Unter Binning wird die Unterteilung eines Merkmals in einzelne Intervalle, auch Bins genannt, verstanden.

In [1]:
import pandas as pd
import numpy as np

In [3]:
movies = pd.DataFrame({'Title of Movie': ['Twice Shy', 'Young Adults', 'Four Times', 'Colorado'],
    'Director of the Movie':['Adam Hersh', 'Alex Cladiff', 'Marc Spencer', 'Susan Sheffield'],
    'duration':[138, 111, 158, 130],
    'frequency': [2, 1, 0, 2],
    'rating':[4,7,5,1]})
    
movies

  Title of Movie Director of the Movie  duration  frequency  rating
0      Twice Shy            Adam Hersh       138          2       4
1   Young Adults          Alex Cladiff       111          1       7
2     Four Times          Marc Spencer       158          0       5
3       Colorado       Susan Sheffield       130          2       1

In [4]:
bin_names_rating = ['low', 'medium', 'high']
bin_names_rating

['low', 'medium', 'high']

In [5]:
movies['rating_category'] = pd.cut(movies['rating'], 3, labels=bin_names_rating)
movies

,Title of Movie,Director of the Movie,duration,frequency,rating,rating_category
0,Twice Shy,Adam Hersh,138,2,4,medium
1,Young Adults,Alex Cladiff,111,1,7,high
2,Four Times,Marc Spencer,158,0,5,medium
3,Colorado,Susan Sheffield,130,2,1,low

In [6]:
bin_names_duration = ['long', 'super long']

In [7]:
bins_calculated = np.linspace(movies['duration'].min(), movies['duration'].max(), 3)
bins_calculated

array([111. , 134.5, 158. ])

In [8]:
movies['duration_category'] = pd.cut(movies['duration'], bins_calculated, labels=bin_names_duration ,include_lowest=True)
movies

,Title of Movie,Director of the Movie,duration,frequency,rating,rating_category,duration_category
0,Twice Shy,Adam Hersh,138,2,4,medium,super long
1,Young Adults,Alex Cladiff,111,1,7,high,long
2,Four Times,Marc Spencer,158,0,5,medium,super long
3,Colorado,Susan Sheffield,130,2,1,low,long

# Binarisierung
Ein einfaches Vorgehen, um Feature Engineering zu betreiben ist die Binarisierung. Hier wird ein Merkmal auf zwei Merkmalsauspr채gungen reduziert und eignet sich f체r Merkmale, die H채ufigkeiten bzw. die Anzahl an Vorkommen repr채sentieren.

In [9]:
movies['watched'] = np.where(movies['frequency']<1, 0, 1)
movies

,Title of Movie,Director of the Movie,duration,frequency,rating,rating_category,duration_category,watched
0,Twice Shy,Adam Hersh,138,2,4,medium,super long,1
1,Young Adults,Alex Cladiff,111,1,7,high,long,1
2,Four Times,Marc Spencer,158,0,5,medium,super long,0
3,Colorado,Susan Sheffield,130,2,1,low,long,1